{if $product_id}
    {* При AJAX подгрузке товаров не видно данного плейсхолдера. Сработает 1 раз на первом товаре, дальше уже будет подтягивать данные из плейсхолдера *}
    {if !$_modx->getPlaceholder("favorite-products")}
        {'@FILE modules/store-product-selection/snippet/setPlaceholder.php' | snippet : ["cookie_key" => "favorite-products"]}
    {/if}

    {if $product_id in list $_modx->getPlaceholder("favorite-products")} 
        {set $active = "active"}
    {/if}

    <button
    class="favorite-product__btn selection-product-btn btn-icon {$active}"
    onclick="window.addProductSelection(this,{$product_id},'favorite-products', { warning:'Товар удален из избранного',success:'Товар добавлен в избранное' })"
    >
        <svg xmlns="http://www.w3.org/2000/svg" width="35" height="35" fill="none"><path fill-rule="evenodd" clip-rule="evenodd" d="M17.368 7.588a7.869 7.869 0 0 0-1.63-1.459 8.313 8.313 0 0 0-4.624-1.408c-4.28 0-7.643 3.403-7.643 7.735 0 1.54.355 3.001.964 4.392 1.888 4.317 6.215 7.96 9.939 11.095 1.072.903 2.094 1.764 2.994 2.586.9-.822 1.922-1.683 2.994-2.586 3.724-3.135 8.05-6.778 9.938-11.095.61-1.39.965-2.852.965-4.392 0-4.332-3.363-7.735-7.644-7.735a8.313 8.313 0 0 0-4.624 1.408 7.869 7.869 0 0 0-1.63 1.46Zm0 19.17c.448-.383.907-.77 1.365-1.156.387-.327.775-.654 1.155-.978 1.522-1.297 3.013-2.614 4.332-3.995 1.633-1.709 2.847-3.353 3.554-4.977.466-1.071.711-2.133.711-3.196 0-2.696-2.068-4.868-4.864-4.868-1.651 0-3.192.737-4.154 1.88l-2.1 2.495-2.098-2.495c-.962-1.143-2.503-1.88-4.155-1.88-2.796 0-4.864 2.172-4.864 4.868 0 1.063.246 2.125.712 3.196.707 1.624 1.92 3.268 3.553 4.977 1.32 1.38 2.81 2.698 4.332 3.995.38.324.768.65 1.156.978.458.386.916.773 1.365 1.157Z" fill="#D3553C"/></svg>
        <svg xmlns="http://www.w3.org/2000/svg" width="35" height="35" fill="none"><path fill-rule="evenodd" clip-rule="evenodd" d="M17.368 7.588a7.869 7.869 0 0 0-1.63-1.459 8.313 8.313 0 0 0-4.624-1.408c-4.28 0-7.643 3.403-7.643 7.735 0 1.54.355 3.001.964 4.392 1.888 4.317 6.215 7.96 9.939 11.095 1.072.903 2.094 1.764 2.994 2.586.9-.822 1.922-1.683 2.994-2.586 3.724-3.135 8.05-6.778 9.938-11.095.61-1.39.965-2.852.965-4.392 0-4.332-3.363-7.735-7.644-7.735a8.313 8.313 0 0 0-4.624 1.408 7.869 7.869 0 0 0-1.63 1.46Z" fill="#D3553C"/></svg>
    </button>
{else}
    Не передан $product_id
{/if}