<?php

$class_key = "msCategory";
$template = 30;
$items = [
    "Стальные подставки",
    "Подставки ППС",
    "Подставки ППФО",
    "Подставки ППФ",
    "Подставки ППТФ",
    "Подставки ППКФ",
    "Чугунные подставки",
    "Подставки ППФ",
    "Подставки ППТФ",
    "Подставки ППТРФ",
    "Подставки ППКРФ",
    "Подставки ППР",
    "Подставки ППКФ",
    "Гидранты",
    "Гидранты подземные",
    "Гидранты надземные",
    "Оросители",
    "Оросители водяные",
    "Оросители СВВ",
    "Оросители СВН",
    "Оросители пенные",
];

$parents = [
    "Каталог",
    "Стальные подставки",
    "Стальные подставки",
    "Стальные подставки",
    "Стальные подставки",
    "Стальные подставки",
    "Каталог",
    "Чугунные подставки",
    "Чугунные подставки",
    "Чугунные подставки",
    "Чугунные подставки",
    "Чугунные подставки",
    "Чугунные подставки",
    "Каталог",
    "Гидранты",
    "Гидранты",
    "Каталог",
    "Оросители",
    "Оросители водяные",
    "Оросители водяные",
    "Оросители",
];

foreach ($items as $index => $pagetitle) {
    $doc = $modx->newObject('modDocument');

    $parent = $modx->getObject('modResource', [
        'pagetitle' => $parents[$index]
    ]);

    if (!$parent) {
        echo "0 - $pagetitle <br>";
        continue;
    }

    $doc->set('parent', $parent->id);
    $doc->set('pagetitle', $pagetitle);
    $doc->set('template', $template);
    $doc->set('class_key', $class_key);
    $doc->set('published', 1);
    $doc->save();

    echo "{$doc->id} - $pagetitle <br>";
}
